duvallee/STM32F746Discovery/Src/ethernetif.c
      GPIO_InitStruct.Pin                                = GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_7;
      GPIO_InitStruct.Mode                               = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Pull                               = GPIO_NOPULL;
      GPIO_InitStruct.Speed                              = GPIO_SPEED_HIGH;
      GPIO_InitStruct.Alternate                          = GPIO_AF11_ETH;
      HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

      GPIO_InitStruct.Pin                                = GPIO_PIN_1 | GPIO_PIN_4 | GPIO_PIN_5;
      GPIO_InitStruct.Mode                               = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Pull                               = GPIO_NOPULL;
      GPIO_InitStruct.Speed                              = GPIO_SPEED_HIGH;
      GPIO_InitStruct.Alternate                          = GPIO_AF11_ETH;
      HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

      GPIO_InitStruct.Pin                                = GPIO_PIN_2 | GPIO_PIN_11 | GPIO_PIN_13 | GPIO_PIN_14;
      GPIO_InitStruct.Mode                               = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Pull                               = GPIO_NOPULL;
      GPIO_InitStruct.Speed                              = GPIO_SPEED_HIGH;
      GPIO_InitStruct.Alternate                          = GPIO_AF11_ETH;
      HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

      /* Enable the Ethernet global Interrupt */
      HAL_NVIC_SetPriority(ETH_IRQn, 0x7, 0);
      HAL_NVIC_EnableIRQ(ETH_IRQn);

      /* Enable Peripheral clock */
      __HAL_RCC_ETH_CLK_ENABLE();
   }
}

/* --------------------------------------------------------------------------
 * Name : HAL_ETH_MspDeInit()
 *
 *
 * -------------------------------------------------------------------------- */
void HAL_ETH_MspDeInit(ETH_HandleTypeDef* ethHandle)
{
   debug_output_info(" \r\n");
   if (ethHandle->Instance == ETH)
   {
      /* Peripheral clock disable */
      __HAL_RCC_ETH_CLK_DISABLE();

      /** ETH GPIO Configuration    
      RMII_REF_CLK ----------------------> PA1
      RMII_MDIO -------------------------> PA2
      RMII_MDC --------------------------> PC1
      RMII_MII_CRS_DV -------------------> PA7
      RMII_MII_RXD0 ---------------------> PC4
      RMII_MII_RXD1 ---------------------> PC5
      RMII_MII_RXER ---------------------> PG2
      RMII_MII_TX_EN --------------------> PG11
      RMII_MII_TXD0 ---------------------> PG13
      RMII_MII_TXD1 ---------------------> PG14
      */
      HAL_GPIO_DeInit(GPIOG, GPIO_PIN_14 | GPIO_PIN_13 | GPIO_PIN_11 | GPIO_PIN_2);
      HAL_GPIO_DeInit(GPIOC, GPIO_PIN_1  | GPIO_PIN_4  | GPIO_PIN_5);
      HAL_GPIO_DeInit(GPIOA, GPIO_PIN_1  | GPIO_PIN_2  | GPIO_PIN_7);

      /* Peripheral interrupt Deinit*/
      HAL_NVIC_DisableIRQ(ETH_IRQn);
   }
}

/* --------------------------------------------------------------------------
 * Name : HAL_ETH_RxCpltCallback()
 *        Ethernet Rx Transfer completed callback
 *
 * -------------------------------------------------------------------------- */
void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth)
{
   osSemaphoreRelease(s_xSemaphore);
}

/*******************************************************************************
   LL Driver Interface ( LwIP stack --> ETH) 
*******************************************************************************/

/* --------------------------------------------------------------------------
 * Name : low_level_init()
 *        In this function, the hardware should be initialized.
 *        Called from ethernetif_init().
 *
 *        [param netif] the already initialized lwip network interface structure
 *                      for this ethernetif
 *
 * -------------------------------------------------------------------------- */
static void low_level_init(struct netif *netif)
{ 
   uint32_t regvalue                                     = 0;
   HAL_StatusTypeDef hal_eth_init_status;

   UNUSED(regvalue);

   debug_output_info("MAC ADDRESS : %02X-%02X-%02X-%02X-%02X-%02X \r\n", MY_MAC_ADDR[0], MY_MAC_ADDR[1], MY_MAC_ADDR[2], MY_MAC_ADDR[3], MY_MAC_ADDR[4], MY_MAC_ADDR[5]);

   /* Init ETH */
   heth.Instance                                         = ETH;
   heth.Init.MACAddr                                     = &MY_MAC_ADDR[0];
   heth.Init.AutoNegotiation                             = ETH_AUTONEGOTIATION_ENABLE;
   heth.Init.Speed                                       = ETH_SPEED_100M;
   heth.Init.DuplexMode                                  = ETH_MODE_FULLDUPLEX;
   heth.Init.MediaInterface                              = ETH_MEDIA_INTERFACE_RMII;
   heth.Init.RxMode                                      = ETH_RXINTERRUPT_MODE;
   heth.Init.ChecksumMode                                = ETH_CHECKSUM_BY_HARDWARE;
   heth.Init.PhyAddress                                  = LAN8742A_PHY_ADDRESS;

   hal_eth_init_status                                   = HAL_ETH_Init(&heth);

   if (hal_eth_init_status == HAL_OK)
   {
      /* Set netif link flag */  
      netif->flags                                       |= NETIF_FLAG_LINK_UP;
   }
   else
   {
      debug_output_error("HAL_ETH_Init() failed !!! : %d \r\n", hal_eth_init_status);
   }

   /* Initialize Tx Descriptors list: Chain Mode */
   hal_eth_init_status                                   = HAL_ETH_DMATxDescListInit(&heth, DMATxDscrTab, &Tx_Buff[0][0], ETH_TXBUFNB);
   if (hal_eth_init_status != HAL_OK)
   {
      debug_output_error("HAL_ETH_DMATxDescListInit() failed : %d !!! \r\n", hal_eth_init_status);
   }
     
   /* Initialize Rx Descriptors list: Chain Mode  */
   hal_eth_init_status                                   = HAL_ETH_DMARxDescListInit(&heth, DMARxDscrTab, &Rx_Buff[0][0], ETH_RXBUFNB);
   if (hal_eth_init_status != HAL_OK)
   {
      debug_output_error("HAL_ETH_DMARxDescListInit() failed : %d !!! \r\n", hal_eth_init_status);
   }

#if LWIP_ARP || LWIP_ETHERNET
   /* set MAC hardware address length */
   netif->hwaddr_len                                     = ETH_HWADDR_LEN;

   /* set MAC hardware address */
   netif->hwaddr[0]                                      = heth.Init.MACAddr[0];
   netif->hwaddr[1]                                      = heth.Init.MACAddr[1];
   netif->hwaddr[2]                                      = heth.Init.MACAddr[2];
   netif->hwaddr[3]                                      = heth.Init.MACAddr[3];
   netif->hwaddr[4]                                      = heth.Init.MACAddr[4];
   netif->hwaddr[5]                                      = heth.Init.MACAddr[5];
  
  /* maximum transfer unit */
  netif->mtu                                             = 1500;
  
  /* Accept broadcast address and ARP traffic */
  /* don't set NETIF_FLAG_ETHARP if this device is not an ethernet one */
  #if LWIP_ARP
    netif->flags                                         |= NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP;
  #else 
    netif->flags                                         |= NETIF_FLAG_BROADCAST;
  #endif /* LWIP_ARP */
  
