duvallee/STM32F746Discovery/Src/ethernetif.c
/* create a binary semaphore used for informing ethernetif of frame reception */
   osSemaphoreDef(SEM);
   s_xSemaphore                                          = osSemaphoreCreate(osSemaphore(SEM), 1);

   /* Enable MAC and DMA transmission and reception */
   hal_eth_init_status                                   = HAL_ETH_Start(&heth); 
   if (hal_eth_init_status != HAL_OK)
   {
      debug_output_error("HAL_ETH_Start() failed : %d !!! \r\n", hal_eth_init_status);
   }

   /* create the task that handles the ETH_MAC */
   osThreadDef(EthIf, ethernetif_input, osPriorityRealtime, 0, INTERFACE_THREAD_STACK_SIZE);
   osThreadCreate(osThread(EthIf), netif);

#if 0 // from lwip application
   /* Read Register Configuration */
   HAL_ETH_ReadPHYRegister(&heth, PHY_ISFR, &regvalue);
   regvalue                                              |= (PHY_ISFR_INT4);

   /* Enable Interrupt on change of link status */ 
   HAL_ETH_WritePHYRegister(&heth, PHY_ISFR , regvalue);
  
   /* Read Register Configuration */
   HAL_ETH_ReadPHYRegister(&heth, PHY_ISFR , &regvalue);
#endif

#endif /* LWIP_ARP || LWIP_ETHERNET */
}

/* --------------------------------------------------------------------------
 * Name : low_level_output()
 *
 * This function should do the actual transmission of the packet. The packet is
 * contained in the pbuf that is passed to the function. This pbuf
 * might be chained.
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @param p the MAC packet to send (e.g. IP packet including MAC addresses and type)
 * @return ERR_OK if the packet could be sent
 *         an err_t value if the packet couldn't be sent
 *
 * @note Returning ERR_MEM here if a DMA queue of your MAC is full can lead to
 *       strange results. You might consider waiting for space in the DMA queue
 *       to become availale since the stack doesn't retry to send a packet
 *       dropped because of memory failure (except for the TCP timers).
 *
 * -------------------------------------------------------------------------- */
static err_t low_level_output(struct netif *netif, struct pbuf *p)
{
   err_t errval;
   struct pbuf *q;
   uint8_t *buffer                                       = (uint8_t *)(heth.TxDesc->Buffer1Addr);
   __IO ETH_DMADescTypeDef *DmaTxDesc;
   uint32_t framelength                                  = 0;
   uint32_t bufferoffset                                 = 0;
   uint32_t byteslefttocopy                              = 0;
   uint32_t payloadoffset                                = 0;
   DmaTxDesc                                             = heth.TxDesc;
   bufferoffset                                          = 0;

   /* copy frame from pbufs to driver buffers */
   for (q = p; q != NULL; q = q->next)
   {
      /* Is this buffer available? If not, goto error */
      if ((DmaTxDesc->Status & ETH_DMATXDESC_OWN) != (uint32_t)RESET)
      {
         errval                                          = ERR_USE;
         /* When Transmit Underflow flag is set, clear it and issue a Transmit Poll Demand to resume transmission */
         if ((heth.Instance->DMASR & ETH_DMASR_TUS) != (uint32_t)RESET)
         {
            /* Clear TUS ETHERNET DMA flag */
            heth.Instance->DMASR                         = ETH_DMASR_TUS;

            /* Resume DMA transmission*/
            heth.Instance->DMATPDR                       = 0;
         }
         debug_output_error("low_level_output() %d failed \r\n", errval);
         return errval;
      }

      /* Get bytes in current lwIP buffer */
      byteslefttocopy                                    = q->len;
      payloadoffset                                      = 0;

      /* Check if the length of data to copy is bigger than Tx buffer size*/
      while ((byteslefttocopy + bufferoffset) > ETH_TX_BUF_SIZE)
      {
         /* Copy data to Tx buffer*/
         memcpy((uint8_t*)((uint8_t*) buffer + bufferoffset), (uint8_t*)((uint8_t*) q->payload + payloadoffset), (ETH_TX_BUF_SIZE - bufferoffset));

         /* Point to next descriptor */
         DmaTxDesc                                       = (ETH_DMADescTypeDef *)(DmaTxDesc->Buffer2NextDescAddr);

         /* Check if the buffer is available */
         if ((DmaTxDesc->Status & ETH_DMATXDESC_OWN) != (uint32_t) RESET)
         {
            errval                                       = ERR_USE;
            /* When Transmit Underflow flag is set, clear it and issue a Transmit Poll Demand to resume transmission */
            if ((heth.Instance->DMASR & ETH_DMASR_TUS) != (uint32_t)RESET)
            {
               /* Clear TUS ETHERNET DMA flag */
               heth.Instance->DMASR                      = ETH_DMASR_TUS;

               /* Resume DMA transmission*/
               heth.Instance->DMATPDR                    = 0;
            }
            debug_output_error("low_level_output() %d failed \r\n", errval);
            return errval;
         }

         buffer                                          = (uint8_t *)(DmaTxDesc->Buffer1Addr);

         byteslefttocopy                                 = byteslefttocopy - (ETH_TX_BUF_SIZE - bufferoffset);
         payloadoffset                                   = payloadoffset + (ETH_TX_BUF_SIZE - bufferoffset);
         framelength                                     = framelength + (ETH_TX_BUF_SIZE - bufferoffset);
         bufferoffset                                    = 0;
      }

      /* Copy the remaining bytes */
      memcpy((uint8_t*)((uint8_t*)buffer + bufferoffset), (uint8_t*)((uint8_t*)q->payload + payloadoffset), byteslefttocopy);
      bufferoffset                                       = bufferoffset + byteslefttocopy;
      framelength                                        = framelength + byteslefttocopy;
   }

   /* Clean and Invalidate data cache */
   SCB_CleanInvalidateDCache();
   /* Prepare transmit descriptors to give to DMA */ 
   HAL_ETH_TransmitFrame(&heth, framelength);
   errval = ERR_OK;
   return errval;
}

/* --------------------------------------------------------------------------
 * Name : low_level_input()
 *
 * Should allocate a pbuf and transfer the bytes of the incoming
 * packet from the interface into the pbuf.
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @return a pbuf filled with the received packet (including MAC header)
 *         NULL on memory error
 *
 * -------------------------------------------------------------------------- */
static struct pbuf * low_level_input(struct netif *netif)
{
   struct pbuf *p                                        = NULL;
   struct pbuf *q                                        = NULL;
   uint16_t len                                          = 0;
   uint8_t *buffer;
   __IO ETH_DMADescTypeDef *dmarxdesc;
   uint32_t bufferoffset                                 = 0;
   uint32_t payloadoffset                                = 0;
   uint32_t byteslefttocopy                              = 0;
   uint32_t i                                            = 0;
   HAL_StatusTypeDef hal_status;
  
   /* get received frame */
   if ((hal_status = HAL_ETH_GetReceivedFrame_IT(&heth)) != HAL_OK)
   {
      return NULL;
   }

   /* Obtain the size of the packet and put it into the "len" variable. */
   len                                                   = heth.RxFrameInfos.length;
   buffer                                                = (uint8_t *) heth.RxFrameInfos.buffer;
  
   if (len > 0)
   {
      /* We allocate a pbuf chain of pbufs from the Lwip buffer pool */
      p                                                  = pbuf_alloc(PBUF_RAW, len, PBUF_POOL);
   }

   /* Clean and Invalidate data cache */
   SCB_CleanInvalidateDCache();

   if (p != NULL)
   {
      dmarxdesc                                          = heth.RxFrameInfos.FSRxDesc;
      bufferoffset                                       = 0;
      for (q = p; q != NULL; q = q->next)
      {
         byteslefttocopy                                 = q->len;
         payloadoffset                                   = 0;

         /* Check if the length of bytes to copy in current pbuf is bigger than Rx buffer size*/
         while ((byteslefttocopy + bufferoffset) > ETH_RX_BUF_SIZE)
         {
            /* Copy data to pbuf */
            memcpy((uint8_t*)((uint8_t*)q->payload + payloadoffset), (uint8_t*)((uint8_t*)buffer + bufferoffset), (ETH_RX_BUF_SIZE - bufferoffset));

