duvallee/STM32F746Discovery/Src/ethernetif.c
            /* Point to next descriptor */
            dmarxdesc                                    = (ETH_DMADescTypeDef *)(dmarxdesc->Buffer2NextDescAddr);
            buffer                                       = (uint8_t *)(dmarxdesc->Buffer1Addr);

            byteslefttocopy                              = byteslefttocopy - (ETH_RX_BUF_SIZE - bufferoffset);
            payloadoffset                                = payloadoffset + (ETH_RX_BUF_SIZE - bufferoffset);
            bufferoffset                                 = 0;
         }
         /* Copy remaining data in pbuf */
         memcpy((uint8_t*)((uint8_t*)q->payload + payloadoffset), (uint8_t*)((uint8_t*)buffer + bufferoffset), byteslefttocopy);
         bufferoffset                                    = bufferoffset + byteslefttocopy;
      }
   }  
  
   /* Release descriptors to DMA */
   /* Point to first descriptor */
   dmarxdesc                                             = heth.RxFrameInfos.FSRxDesc;
   /* Set Own bit in Rx descriptors: gives the buffers back to DMA */
   for (i = 0; i < heth.RxFrameInfos.SegCount; i++)
   {  
      dmarxdesc->Status                                  |= ETH_DMARXDESC_OWN;
      dmarxdesc                                          = (ETH_DMADescTypeDef *)(dmarxdesc->Buffer2NextDescAddr);
   }
    
    /* Clear Segment_Count */
    heth.RxFrameInfos.SegCount                           = 0;  
  
   /* When Rx Buffer unavailable flag is set: clear it and resume reception */
   if ((heth.Instance->DMASR & ETH_DMASR_RBUS) != (uint32_t) RESET)
   {
      /* Clear RBUS ETHERNET DMA flag */
      heth.Instance->DMASR                               = ETH_DMASR_RBUS;
      /* Resume DMA reception */
      heth.Instance->DMARPDR                             = 0;
   }
   return p;
}

/* --------------------------------------------------------------------------
 * Name : low_level_input()
 *
 * This function should be called when a packet is ready to be read
 * from the interface. It uses the function low_level_input() that
 * should handle the actual reception of bytes from the network
 * interface. Then the type of the received packet is determined and
 * the appropriate input function is called.
 *
 * @param netif the lwip network interface structure for this ethernetif
 *
 * -------------------------------------------------------------------------- */
void ethernetif_input( void const * argument ) 
{
   struct pbuf *p;
   struct netif *netif                                   = (struct netif *) argument;

   for (;;)
   {
      if (osSemaphoreWait(s_xSemaphore, TIME_WAITING_FOR_INPUT) == osOK)
      {
         do
         {   
            p                                            = low_level_input(netif);
            if (p != NULL)
            {
               if (netif->input(p, netif) != ERR_OK)
               {
                  pbuf_free(p);
               }
            }
         } while(p != NULL);
      }
   }
}

#if !LWIP_ARP
/* --------------------------------------------------------------------------
 * Name : low_level_input()
 *
 * This function has to be completed by user in case of ARP OFF.
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @return ERR_OK if ...
 *
 * -------------------------------------------------------------------------- */
static err_t low_level_output_arp_off(struct netif *netif, struct pbuf *q, ip_addr_t *ipaddr)
{  
   err_t errval;
   errval                                                = ERR_OK;
   return errval;  
}
#endif /* LWIP_ARP */ 

/* --------------------------------------------------------------------------
 * Name : low_level_input()
 *
 * Should be called at the beginning of the program to set up the
 * network interface. It calls the function low_level_init() to do the
 * actual setup of the hardware.
 *
 * This function should be passed as a parameter to netif_add().
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @return ERR_OK if the loopif is initialized
 *         ERR_MEM if private data couldn't be allocated
 *         any other err_t on error
 *
 * -------------------------------------------------------------------------- */
err_t ethernetif_init(struct netif *netif)
{
   LWIP_ASSERT("netif != NULL", (netif != NULL));

   debug_output_info(" \r\n");

#if LWIP_NETIF_HOSTNAME
   /* Initialize interface hostname */
   netif->hostname                                       = "lwip";
#endif /* LWIP_NETIF_HOSTNAME */

   netif->name[0]                                        = IFNAME0;
   netif->name[1]                                        = IFNAME1;
   /* We directly use etharp_output() here to save a function call.
   * You can instead declare your own function an call etharp_output()
   * from it if you have to do some checks before sending (e.g. if link
   * is available...) */

#if LWIP_IPV4
#if LWIP_ARP || LWIP_ETHERNET
#if LWIP_ARP
   netif->output                                         = etharp_output;
#else
   /* The user should write ist own code in low_level_output_arp_off function */
   netif->output                                         = low_level_output_arp_off;
#endif /* LWIP_ARP */
#endif /* LWIP_ARP || LWIP_ETHERNET */
#endif /* LWIP_IPV4 */

#if LWIP_IPV6
   netif->output_ip6                                     = ethip6_output;
#endif /* LWIP_IPV6 */

   netif->linkoutput                                     = low_level_output;

   /* initialize the hardware */
   low_level_init(netif);

   return ERR_OK;
}

/* --------------------------------------------------------------------------
 * Name : sys_jiffies()
 *
 * @brief  Returns the current time in milliseconds
 *         when LWIP_TIMERS == 1 and NO_SYS == 1
 * @param  None
 * @retval Time
 *
 * -------------------------------------------------------------------------- */
u32_t sys_jiffies(void)
{
   return HAL_GetTick();
}

/* --------------------------------------------------------------------------
 * Name : sys_now()
 *
 * @brief  Returns the current time in milliseconds
 *         when LWIP_TIMERS == 1 and NO_SYS == 1
 * @param  None
 * @retval Time
 *
 * -------------------------------------------------------------------------- */
u32_t sys_now(void)
{
   return HAL_GetTick();
}

#if LWIP_NETIF_LINK_CALLBACK
/* --------------------------------------------------------------------------
 * Name : ethernetif_update_config()
 *
 * @brief  Link callback function, this function is called on change of link status
 *         to update low level driver configuration.
 * @param  netif: The network interface
 * @retval None
 *
 * -------------------------------------------------------------------------- */
void ethernetif_update_config(struct netif *netif)
{
   __IO uint32_t tickstart                               = 0;
   uint32_t regvalue                                     = 0;

